[
  {
    "title": "2026 Summer Internship Program - Chief Investment Office (New York, NY)",
    "company": "BNY",
    "description": "Job Description\n\n2026 BNY Summer Internship Program – Chief Investment Office (New York, NY)\n\nAt BNY, our culture allows us to run our company better and enables employees’ growth and success. As a leading global financial services company at the heart of the global financial system, we influence nearly 20% of the world’s investible assets. Every day, our teams harness cutting-edge AI and breakthrough technologies to collaborate with clients, driving transformative solutions that redefine industries and uplift communities worldwide.\n\nRecognized as a top destination for innovators and champions of inclusion, BNY is where bold ideas meet advanced technology and exceptional talent. Together, we power the future of finance – and this is what is all about. Join us and be part of something extraordinary.\n\nWe’re seeking future team members for our Chief Investment Office Team with roles located in New York, NY.\n\nSummer Internship Program \n\nThe BNY Summer Internship Program provides high-potential students with a well-rounded, rewarding 10-week internship experience, as well as an inside look into what it is like to work for a global financial services organization that has been innovating and serving clients since 1784. Interns work on challenging projects, collaborate in teams, and build professional networks while gaining insight into BNY and skills required to be successful in workforce.\n\nFrom day one, summer interns are immersed in BNY’s innovative and dynamic company culture as they will receive:     \n• Enterprise-led intern orientation program combined with ongoing an executive speaker series and virtual training curriculum designed specifically for summer interns \n• Meaningful and challenging work assignments that deliver learning and skill development through practical work, mentorship, and training  \n• Career development and networking support from a host of corporate leaders including internship managers, senior and peer mentors, business stakeholders and a dedicated program manager  \n• Exposure to different areas of business throughout the organization \n• Comprehensive professional etiquette and financial services fundamentals training, along with technical and business acumen development   \n• Understanding of BNY’s commitment to diversity and inclusion   \n• A collaborative and supportive community with full commitment of top-level management to deliver a premier internship/talent pipeline program within the financial services industry  \n\nChief Investment Office\n\nAs a Chief Investment Office (CIO) Intern, you will gain firsthand experience in the strategic financial decisions that underpin BNY, a global financial institution. The CIO team oversees BNY’s securities portfolio, investing in a way that balances liquidity, safety and yield, while also actively managing the interest rate positioning of the firm. The team leverages investment metrics and balance sheet metrics to optimize the Portfolio and actively monitors developments in global markets and industries.\n\nThe Chief Investment Office (CIO) at BNY plays a critical role in shaping the portfolio’s investment strategy, overseeing portfolio construction, managing risk, and monitoring developments in global markets and diverse industries. As a CIO intern, you will partner closely with portfolio managers, credit analysts, and portfolio strategy to help ensure that BNY’s securities holdings meet our rigorous risk, return, and compliance standards. This is an excellent opportunity for someone early in their career to develop analytical skills and gain hands-on exposure to institutional portfolio and bank balance sheet management.\n\nInterns are encouraged to bring curiosity, analytical rigor, and innovative thinking to the table. This internship is ideal for students who aspire to develop strong financial acumen, strategic thinking, and problem-solving skills within a complex and dynamic industry landscape.\n\nProgram Eligibility\n• Enrollment in a 4-year undergraduate degree program with a strong focus on business-related and/or technology-related majors preferred\n• Graduating in Dec 2026 or May 2027 (U.S.) \n• Minimum cumulative GPA of 3.0 or better   \n• Does not require sponsorship for employment visa status (now or in the future) in the country where applying.  \n\nAt BNY, our culture speaks for itself, check out the latest BNY news at:\n\nBNY Newsroom\n\nBNY LinkedIn\n\nHere’s a Few Of Our Recent Awards\n• America’s Most Innovative Companies, Fortune, 2025\n• World’s Most Admired Companies, Fortune 2025\n• “Most Just Companies”, Just Capital and CNBC, 2025\n\nOur Benefits And Rewards\n\nBNY offers highly competitive compensation, benefits, and wellbeing programs rooted in a strong culture of excellence and our pay-for-performance philosophy. We provide access to flexible global resources and tools for your life’s journey. Focus on your health, foster your personal resilience, and reach your financial goals as a valued member of our team, along with generous paid leaves, including paid volunteer time, that can support you and your family through moments that matter.\n\nBNY is an Equal Employment Opportunity/Affirmative Action Employer - Underrepresented racial and ethnic groups/Females/Individuals with Disabilities/Protected Veterans.\n\nBNY assesses market data to ensure a competitive compensation package for our employees. The base salary for this position is expected to be between $41,600 and $85,000 per year at the commencement of employment. However, base salary if hired will be determined on an individualized basis, including as to experience and market location, and is only part of the BNY total compensation package, which, depending on the position, may also include commission earnings, discretionary bonuses, short and long-term incentive packages, and Company-sponsored benefit programs. This position is at-will and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation) at any time, including for reasons related to individual performance, change in geographic location, Company or individual department/team performance, and market factors.",
    "location": "New York, NY",
    "employment_type": "Full-time",
    "posted_at": "16 hours ago",
    "apply_link": "https://www.linkedin.com/jobs/view/2026-summer-internship-program-chief-investment-office-new-york-ny-at-bny-4280101150?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "CNN Original Series & Films Program Development Intern NYC - Fall 2025",
    "company": "WARNERMEDIA",
    "description": "Welcome to Warner Bros. Discovery… the stuff dreams are made of.\n\nWho We Are…\n\nWhen we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next…\n\nFrom brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.\n\nCNN Original Series & Films Program Development Intern: NYC - Fall 2025\n\nApplication Deadline: Sunday, August 24th*\n• Pro Tip: Submit your application as soon as possible – applications could close earlier due to applicant volume!*\n\nYour New Role\n\nThis internship will be located in the NYC area. The selected intern will be expected to join us in the office on a regular cadence based on the intern manager’s in office schedule. The CNN Originals group develops, produces and acquires original, long-form unscripted programming for CNN Worldwide under the banner of CNN Original Series, CNN Films, CNN Flashdocs, and CNN Studios including titles such as “Navalny,” “Anthony Bourdain Parts Unknown,” “Eva Longoria: Searching for Mexico,” “Super/Man: The Christopher Reeve Story,” “Carville: Winning is Everything, Stupid,” and more.\n\nYour Role Accountabilities\n• Work closely with the Director of Integrated Content Development and the Production Assistant to aid in prepping assets and files for linear broadcast segments.\n• Pull archival elements for various broadcast packages, track and clip segments as they air.\n• Have the opportunity to assist on shoots on set when applicable and are welcome to share ideas for editorial segments or guests.\n• Work with the Production Assistant to help organize, log, and track materials for incoming pitches and are encouraged to share thoughts and opinions on incoming pitches.\n• Aid in development research such as sourcing IP and industry tracking.\n• Have the opportunity to workshop and receive feedback on an idea for an independent series or film pitch project guided by the PA.\n\nQualifications & Experience\n• Strong passion for longform documentary and journalism relating to history, pop culture, news, politics and more.\n• Strong organizational skills and attention to detail, with the ability to work effectively in a fast-paced, high-pressure, collaborative environment.\n• Proficiency in conducting online research and using news-related software/tools.\n• Familiarity with Excel, SharePoint, and the ability to quickly learn other software tools for production needs.\n• A collaborative team player with strong communication skills and creative ideas that they are excited to share with the team.\n• Must be actively enrolled in an accredited college or university degree program for the full duration of the internship (proof of enrollment required)\n• Must be a rising Junior or Senior Undergraduate Student (18 years or older)\n• Must be in academic good standing (3.0 or above GPA) A transcript will be required to verify your GPA if an offer is extended.\n• Warner Bros. Discovery will only consider candidates who are presently authorized to work for any employer in the United States and who will not require work visa sponsorship from Warner Bros. Discovery now or in the future in order to retain their authorization to work in the United States. Candidates currently on any student or exchange visa, including F-1 CPT, F-1 OPT, J-1, M-1, etc., will not be eligible for the internship program.\n\nNice-to-Haves\n• Experience in journalism, documentary filmmaking, and production is a plus.\n• Prior internships in a newsroom or with a production company.\n\nHow We Get Things Done\n\nThis last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\n\nWhat to know before applying:\n• The duration of the program is 10 weeks\n\nProgram dates:\n• Start Date: October 6th\n• End Date: December 12th\n• Interns will be expected to work 16-24 hours per week in a hybrid capacity.\n• Our internships are paid opportunities with a competitive hourly wage. Credit is not required; however, we will provide the necessary documentation for school credit if desired. Relocation is not provided.\n• Interviewing will take place from August through mid-September. A WBD team member will contact you if your experiences and interests match an open internship position. Due to the high volume of applications, we are unable to give individual status updates.\n\nAbout Our Internship Program\n\nWBD's Internship Program is designed to nurture students professionally and personally. We attract the country’s boldest and brightest students for paid, for-credit, real-world internship experiences in the entertainment, tech, sports, news and media industries. We offer career-defining opportunities to learn valuable skills that will help you prepare for a successful future.\n\nReady to learn more? Here’s what we offer:\n• Hands-on work with passionate, talented team members in your field\n• Mentorship from some of the industry’s kindest and most passionate entertainment veterans\n• Engaging events including professional development seminars, panels with recruiters and former interns, intern-exclusive events, and so much more\n• Access to top-level executives and employees through our Speaker Series and Roundtables\n• Incredible networking opportunities with industry-leading professionals and a robust intern alumni network\n• A creative, collaborative, and inclusive company culture\n\nWhat you can expect to take away from the semester:\n• Opportunities to develop professionally and uncover skills you didn’t know you had\n• The insider scoop on the entertainment industry and what happens behind the scenes\n• Relationships that will go beyond your collegiate career\n• Real-life experiences that will provide you with the confidence to delve into your next adventure\n\nIn compliance with local law, we are disclosing compensation for roles in locations where legally required. Pay Rate: $19 per hour USD for undergrad interns.\n\nHow We Get Things Done…\n\nThis last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\n\nChampioning Inclusion at WBD\nWarner Bros. Discovery embraces the opportunity to build a workforce that reflects a wide array of perspectives, backgrounds and experiences. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.\n\nIf you’re a qualified candidate with a disability and you require adjustments or accommodations during the job application and/or recruitment process, please visit our accessibility page for instructions to submit your request.",
    "location": "New York, NY",
    "employment_type": "Part-time",
    "posted_at": "2 days ago",
    "apply_link": "https://careers.wbd.com/global/en/job/R000096827/CNN-Original-Series-Films-Program-Development-Intern-NYC-Fall-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "2026 BNY Summer Internship Program - Market and Wealth Services (New York, NY)",
    "company": "BNY",
    "description": "Job Description\n\n2026 BNY Summer Internship Program – Market and Wealth Services (New York, NY)\n\nAt BNY, our culture allows us to run our company better and enables employees’ growth and success. As a leading global financial services company at the heart of the global financial system, we influence nearly 20% of the world’s investible assets. Every day, our teams harness cutting-edge AI and breakthrough technologies to collaborate with clients, driving transformative solutions that redefine industries and uplift communities worldwide.\n\nRecognized as a top destination for innovators and champions of inclusion, BNY is where bold ideas meet advanced technology and exceptional talent. Together, we power the future of finance – and this is what is all about. Join us and be part of something extraordinary.\n\nWe’re seeking future team members for our Market and Wealth Services Team with roles located in New York, NY and Jersey City, NJ.\n\nSummer Internship Program \n\nThe BNY Summer Internship Program provides high-potential students with a well-rounded, rewarding 10-week internship experience, as well as an inside look into what it is like to work for a global financial services organization that has been innovating and serving clients since 1784. Interns work on challenging projects, collaborate in teams, and build professional networks while gaining insight into BNY and skills required to be successful in workforce.\n\nFrom day one, summer interns are immersed in BNY’s innovative and dynamic company culture as they will receive:     \n• Enterprise-led intern orientation program combined with ongoing an executive speaker series and virtual training curriculum designed specifically for summer interns \n• Meaningful and challenging work assignments that deliver learning and skill development through practical work, mentorship, and training  \n• Career development and networking support from a host of corporate leaders including internship managers, senior and peer mentors, business stakeholders and a dedicated program manager  \n• Exposure to different areas of business throughout the organization \n• Comprehensive professional etiquette and financial services fundamentals training, along with technical and business acumen development   \n• Understanding of BNY’s commitment to diversity and inclusion   \n• A collaborative and supportive community with full commitment of top-level management to deliver a premier internship/talent pipeline program within the financial services industry  \n\nMarket and Wealth Services\n\nBNY’s Market & Wealth Services (M&WS) is comprised of the Markets, Pershing, Treasury Services, Credit Services, Global Clearing, Global Collateral, and Depositary Receipts businesses and plays a crucial role at the center of global finance. The M&WS Summer Internship Program offers developmental opportunities and exposure to the platform through valuable, strategic projects that align to critical business needs in trading, sales and product. This program is designed for the driven student seeking real-world experience, access to over 4,000 employees based in more than 20 countries with whom you will have daily interactions with, while learning about the needs of clients across various markets and financial conditions.\n\nProgram Eligibility\n• Enrollment in a 4-year undergraduate degree program with a strong focus on business-related and/or technology-related majors preferred\n• Graduating in Dec 2026 or May 2027 (U.S.)\n• Minimum cumulative GPA of 3.0 or better \n• Does not require sponsorship for employment visa status (now or in the future) in the country where applying.\n\nAt BNY, our culture speaks for itself, check out the latest BNY news at:\n\nBNY Newsroom\n\nBNY LinkedIn\n\nHere’s a Few Of Our Recent Awards\n• America’s Most Innovative Companies, Fortune, 2025\n• World’s Most Admired Companies, Fortune 2025\n• “Most Just Companies”, Just Capital and CNBC, 2025\n\nOur Benefits And Rewards\n\nBNY offers highly competitive compensation, benefits, and wellbeing programs rooted in a strong culture of excellence and our pay-for-performance philosophy. We provide access to flexible global resources and tools for your life’s journey. Focus on your health, foster your personal resilience, and reach your financial goals as a valued member of our team, along with generous paid leaves, including paid volunteer time, that can support you and your family through moments that matter.\n\nBNY is an Equal Employment Opportunity/Affirmative Action Employer - Underrepresented racial and ethnic groups/Females/Individuals with Disabilities/Protected Veterans.\n\nBNY assesses market data to ensure a competitive compensation package for our employees. The base salary for this position is expected to be between $41,600 and $85,000 per year at the commencement of employment. However, base salary if hired will be determined on an individualized basis, including as to experience and market location, and is only part of the BNY total compensation package, which, depending on the position, may also include commission earnings, discretionary bonuses, short and long-term incentive packages, and Company-sponsored benefit programs.\n\nThis position is at-will and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation) at any time, including for reasons related to individual performance, change in geographic location, Company or individual department/team performance, and market factors.",
    "location": "New York, NY",
    "employment_type": "Full-time",
    "posted_at": "16 hours ago",
    "apply_link": "https://www.linkedin.com/jobs/view/2026-bny-summer-internship-program-market-and-wealth-services-new-york-ny-at-bny-4279993960?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "SAP iXp Intern - Business Operations",
    "company": "SAP",
    "description": "We help the world run better\nAt SAP, we keep it simple: you bring your best to us, and we'll bring out the best in you. We're builders touching over 20 industries and 80% of global commerce, and we need your unique talents to help shape what's next. The work is challenging – but it matters. You'll find a place where you can be yourself, prioritize your wellbeing, and truly belong. What's in it for you? Constant learning, skill growth, great benefits, and a team that wants you to grow and succeed.\n\nAbout the SAP Internship Experience Program\n\nThe SAP Internship Experience Program is SAP’s global, strategic, paid internship program that provides university students with opportunities to find purpose in their careers.\n\nThree reasons to intern at SAP\n\n1. Culture of collaboration: Meet with mentors, make new friends across the globe, and create a thriving personal network.\n\n2. Project-driven experience: gain cross-functional skills from our virtual and in-person learning sessions, diverse subject matter experts, and project deliverables.\n\n3. Gain visibility: with the SAP Internship Experience Program in your title, you’ll have a global network of SAP leaders, entrepreneurs, and career development opportunities at your fingertips.\n\nWhat you’ll do:\n\nPosition title: SAP iXp Intern - Business Operations\n\nLocation: Hybrid - Hudson Yards\n\nExpected start date: September 2025\n\nDuration: 6 - 12 months\n\nWorking hours: Full-time ( 40 hrs./week)\n\nWe seek a Business Operations intern to join our Sales Performance Management team. This role is ideal for recent college graduates with a degree in Finance, Accounting, or Mathematics or related fields, who are looking to gain practical experience in customer and product analytics. The intern will be responsible for building analytics solutions, responding to ad-hoc reporting requests, and developing and deploying an overall SPM team reporting publishing candence.\n\nKey Responsibilities:\n\nThe Sales Performance Management (SPM) Line of Business is focused on the growth and success of the SPM portfolio. The SPM portfolio is a set of tools and processes that drive the revenue-generating and revenue-persuading behaviors and resources needed for organizations to meet their corporate goals.\n\nThe SPM portfolio consists of several solutions, including SAP Incentive Management, SAP Territory and Quota, SAP Agent Performance Management, SAP Agent Connect, and others.\n\nThe SPM business is in incubation status and does not have standard functions like Business Operations fully staffed, yet performance reporting and analytics are clearly key functions that need to be addressed. This is a great opportunity for a mature intern who is interested in using their Microsoft Office skills and data and analytics skills to jumpstart their career.\n\nWhat you bring:\n\nWe’re looking for someone who takes initiative, perseveres, and stays curious. You like to work on meaningful innovative projects and are energized by lifelong learning.\n\nRequired Qualifications:\n\nPreferred Qualifications:\n\nMeet your team:\n\nThis will be a in-office role with the potential to advance to hybrid remote as the resource progresses and becomes more proficient in the role. You will be part of a hub of other SPM interns working together to help the SPM leadership team scale. It is extremely important the candidates can operate in a team environment and are able to work both independently with minimal supervision, but also help others when they may have some downtime in their schedule.\n\nBring out your best\nSAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with two hundred million users and more than one hundred thousand employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, you can bring out your best.\n\nWe win with inclusion\nSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better world.\n\nSAP is committed to the values of Equal Employment Opportunity and provides accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com.\n\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.\n\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\n\nCompensation Range Transparency: SAP believes the value of pay transparency contributes towards an honest and supportive culture and is a significant step toward demonstrating SAP’s commitment to pay equity. SAP provides the annualized compensation range inclusive of base salary and variable incentive target for the career level applicable to the posted role. The targeted combined range for this position is 15-62 USD. The actual amount to be offered to the successful candidate will be within that range, dependent upon the key aspects of each case which may include education, skills, experience, scope of the role, location, etc. as determined through the selection process. Any SAP variable incentive includes a targeted dollar amount and any actual payout amount is dependent on company and personal performance. Please reference this link for a summary of SAP benefits and eligibility requirements: SAP North America Benefits.\n\nAI Usage in the Recruitment Process\n\nFor information on the responsible use of AI in our recruitment process, please refer to our Guidelines for Ethical Usage of AI in the Recruiting Process.\n\nPlease note that any violation of these guidelines may result in disqualification from the hiring process.\n\nRequisition ID: 433213 | Work Area: Corporate Operations | Expected Travel: 0 - 10% | Career Status: Student | Employment Type: Limited Full Time | Additional Locations: #LI-Hybrid\n\nNearest Major Market: Manhattan\n\nNearest Secondary Market: New York City\n\nJob Segment:\nERP, Cloud, SAP, Operations Manager, Intern, Technology, Operations, Entry Level",
    "location": "New York, NY",
    "employment_type": "Full-time",
    "posted_at": "22 hours ago",
    "apply_link": "https://jobs.sap.com/job/New-York-SAP-iXp-Intern-Business-Operations-NY-10001/1233483201/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "Store Executive Intern (Store Leadership Intern) - New York City (Starting Summer 2026)",
    "company": "Target",
    "description": "The pay range per hour is $29.75- $30.75.\n\nPay is based on several factors which vary based on position. These include labor markets and in some instances may include education, work experience and certifications. In addition to your pay, Target cares about and invests in you as a team member, so that you can take care of yourself and your family. Target offers eligible team members and their dependents comprehensive health benefits and programs, which may include medical, vision, dental, life insurance and more, to help you and your family take care of your whole selves. Other benefits for eligible team members include 401(k), employee discount, short term disability, long term disability, paid sick leave, paid national holidays, and paid vacation. Find competitive benefits from financial and education to well-being and beyond at https://corporate.target.com/careers/benefits\n\nALL ABOUT TARGET\n\nWorking at Target means helping all families discover the joy of everyday life. We bring that vision to life through our values and culture. Learn more about Target here.\n\nALL ABOUT THE STORES EXECUTIVE LEADERSHIP INTERNSHIP\nExperience firsthand what it’s like to lead a retail team within a Target store. This internship is a paid 40 hr/week, hands-on training program to develop and prepare for your store leadership. As a Stores Executive Intern, you will get a valuable realistic preview of the Executive Team Leader role (Assistant Store Manager) over a defined period of time. Within this store management internship, you will work closely with other managers and team members to develop an understanding of how Target’s retail business works and what it takes to excel in a management role. You will be introduced to multiple areas of the store’s business, but the majority of your time will be spent leading amongst the team, identifying and working towards store priorities, and delivering great guest service.\n\nThis program is designed to teach individuals how to lead within a retail store amongst the store team:\n• You’ll learn about how to drive guest experience and how to impact your store’s financial, team, and operational performance.\n• You’ll work alongside a mentor and learn how they effectively lead their department within the store.\n• You will have the opportunity to step into leading your Mentors departments- of course, we will be there to guide you and help you learn along the way!\n• You will spend your days learning to lead and motivate a team, drive sales results, merchandise products, and provide an exceptional experience for our guests.\n• Your development will be a top priority of ours, and to ensure you’re feeling supported, you can expect ongoing developmental conversations.\n• While you’ll lead and support the execution of daily operations by working beside your team members, your leadership will build the culture and guide your team to grow and achieve goals.\n\nAt Target, we believe in our leaders having meaningful experiences that help them build and develop skills for a career. The goal of the Stores Executive internship is to provide a realistic job preview of an ETL role. The role of a Stores Executive Intern can provide you with the skills and experience of:\n• Guest service fundamentals and experience building and managing a guest first team culture across the store\n• Guest engagement; problem-solving and resolution\n• Retail business fundamentals\n• Setting and planning department(s) monthly/quarterly workload to support business priorities and managing a team to deliver service and sales goals\n• Managing a team of hourly team members and team leaders while creating business strategies and goals\n• Recruiting, selecting and talent management of hourly team members and leaders\n\nAs a Stores Executive Intern, no two days are ever the same, but a typical day will most likely include the following responsibilities:\n• Spending time on the store salesfloor and backroom leading amongst team members and aligning the team on daily business priorities\n• Working alongside your Executive Team Lead (ETL) mentor and other leaders in the building to gain an understanding of their roles\n• Leading through daily priorities (stocking shelves, ensuring a safe and welcoming environment that’s inviting to guests, helping build displays within the store, etc.)\n• Partnering with leaders regarding team member performance by teaching, coaching, training, and delivering timely performance feedback\n• Addressing team member concerns and removing hurdles to ensure smooth operations and goal attainment\n• Leading/presenting at daily huddles with peer/leadership team\n• Planning daily goals and organizing plans within the building\n• Providing summary of results and priorities with peer/leadership team\n• Working with store leaders each day to set goals and expectations\n• Reviewing business reporting and guest insights to understand, troubleshoot and follow up on opportunity areas. Work with store leaders each day to set goals and expectations\n• Delivering an exceptional guest experience by ensuring team members are knowledgeable and empowered to make it right for guests\n• Providing new ideas and recommend solutions to business or team opportunities\n• Taking the initiative to learn how to be a Target leader by seeking out opportunities for growth and development; continuously learning throughout the internship experience\n• Commit to learning Target’s expectations of leaders and use them to personally develop by asking questions and seeking feedback\n• Actively participate in internship program training activities, developmental opportunities and events\n• Demonstrate a willingness to take strategic risks and take on new assignments\n• Demonstrate a culture of ethical conduct, safety, and compliance; lead the team to work in the same way and hold others accountable to this commitment\n• Work in a safe manner at all times to benefit yourself and others; identify and correct hazards; comply with all safety policies and best practices\n• Foster an inclusive, equitable, safe, and secure culture\n• Carry out principal duties and responsibilities by the department\n• Gain an understanding of all business areas to develop business acumen\n• Create a welcoming experience by greeting guests as you are completing your daily tasks.\n• When guests need assistance, engage with guests in a welcoming way, to help solve their specific needs.\n• Thank guests and let them know we’re happy they chose to shop at Target\n• All other duties based on business needs\n\nALL ABOUT YOU\n\nThis may be the right job for you if:\n• You enjoy interacting and helping others - including guests that shop our store and fellow team members you work with.\n• You thrive in a fast-moving, highly active and physically demanding role, where teamwork, flexibility, and creative problem solving are key to success.\n• You are open to working a flexible work schedule with varying hours, days or shifts (including nights, weekends, holidays and other peak shopping times).\n\nThe good news is that we have some amazing training that will help teach you how to be an effective leader within our stores. But there are a few things you need from the get-go:\n• Previous retail experience preferred, but not required\n• Strong interest in working in retail, specifically within our stores in management\n• Leadership skills and team-oriented thinking\n• Learn and adapt to current technology needs\n• Work independently and as part of a team\n• Manage workload and prioritize tasks independently\n• Welcoming and helpful attitude\n• Effective communication skills\n\nWe are an awesome place to work and care about our teams, so we want to make sure we are clear on a few more basics that we expect:\n• Access all areas of the building to respond to guest or team member issues\n• Interpret instructions, reports, and information\n• Accurately handle cash register operations as needed\n• Climb up and down ladders as needed\n• Scan, handle and move merchandise efficiently and safely, including frequently lifting or moving merchandise up to 10 pounds and occasionally moving merchandise up to 444 pounds\n• Ability to communicate on multiple frequency devices and operate handheld scanners, and other technology equipment as directed\n• Flexible work schedule (e.g., nights, weekends and holidays) and reliable and prompt attendance necessary\n\nFind competitive benefits from financial and education to well-being and beyond at https://corporate.target.com/careers/benefits.\n\nBenefits Eligibility\nPlease paste this url into your preferred browser to learn about benefits eligibility for this role: https://tgt.biz/BenefitsForYou_G | Pegue esta URL en su navegador preferido para obtener información sobre la elegibilidad de este puesto para recibir beneficios: https://tgt.biz/BenefitsForYou_G\n\nAmericans with Disabilities Act (ADA)\nTarget will provide reasonable accommodations with the application process upon your request as required to comply with applicable laws. If you have a disability and require assistance in this application process, please visit your nearest Target store or reach out to Guest Services at 1-800-440-0680 for additional information.",
    "location": "New York, NY",
    "employment_type": "Part-time",
    "posted_at": "5 days ago",
    "apply_link": "https://corporate.target.com/jobs/w93/05/store-executive-intern-store-leadership-intern-new-york-city-starting-summer-2026?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "Social Media & Fashion Intern",
    "company": "Blue Revival",
    "description": "SOCIAL MEDIA INTERNSHIP\n\nDATES: September 9th- December 9th\n\nHOURS: Flexible, 2-3 days in office\n\nLOCATION: 1411 Broadway New York, NY; between 39th & 40th St.\n\nOVERVIEW: We are a contemporary, denim-centric lifestyle brand based in NYC. Blue Revival is available to purchase at select stores including Nordstrom.com, Neiman Marcus, Bloomingdales, Nuuly & Verishop and as well as 500 Boutiques nationwide. Please check out our website at bluerevival.com. You will have the chance to see how both retail and wholesale markets function. We are looking for college students who are looking to gain real experience in the fashion industry.\n\n· You must be interested in social media and fashion\n\n· Up to date with the latest fashion trends/news\n\n· Thrive in a fast-paced environment and able to stay organized\n\n· Good communication skills\n\n· Hardworking and passionate about the fashion industry\n\nThe main duties for this internship are:\n\n· Create Tiktoks and Reels in the showroom based on current trends.\n\n· Assist in the editing of product videos that will be posted on Blue Revival’s Tiktok & Instagram.\n\n· Scroll through TikTok to find trends that you will help create in our showroom.\n\n· Use Canva or Photoshop to create outfit mood boards for Social media platforms.\n\n· Assist with other fashion related tasks that will vary based on the week.\n\n· Creative brainstorming to expand the brand’s consumer base with use of social media marketing\n\n· Follows directors lead to create footage for our social media platforms Instagram, Facebook, and/or Tiktok. You must be comfortable creating content\n\nPlease note that this is an UNPAID internship with the chance to gain school credit. You will have the opportunity to gain hands on experience & network with people who have 20+ years of experience working in the industry.\n\nHOW TO APPLY:\n\n· Send resume, social media handles, & short summary about why you would like the position to kirsten@bluerevival.com\n\n· Must be able to commute to NY office twice a week",
    "location": "New York, NY",
    "employment_type": "Internship",
    "posted_at": "6 hours ago",
    "apply_link": "https://www.linkedin.com/jobs/view/social-media-fashion-intern-at-blue-revival-4280192912?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "CNN News Show Team Internships: NYC - Fall 2025",
    "company": "WARNERMEDIA",
    "description": "Welcome to Warner Bros. Discovery… the stuff dreams are made of.\n\nWho We Are…\n\nWhen we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next…\n\nFrom brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.\n\nApplication Deadline: Sunday, August 24th*\n• Pro Tip: Submit your application as soon as possible – applications could close earlier due to applicant volume!*\n\nYour New Role\n\nWe have multiple CNN Show Team opportunities available. By applying to this posting, you will be considered for all internship opportunities within this area. These internships will be located in the NYC area. The selected interns will be expected to join us in the office on a regular cadence based on the intern managers in office schedule.\n\nThis could include, but is not limited to:\n• Anderson Cooper 360\n• Laura Coates Live Intern\n• CNN News- EBoF Show Team Intern\n• The Source with Kaitlan Collins\n• NewsNight with Abby Phillip Intern\n\nYour Role Accountabilities\n\nDuties could include:\n• Assist in real-time news coverage by monitoring news sources, gathering information, and verifying facts to ensure accurate reporting during breaking news events.\n• Conduct research on various topics, individuals, and current events to support the show's editorial process. Compile relevant information for use in on-air segments and interviews.\n• Work closely with producers, researchers, and other show team members to contribute to the development of news stories, segments, and interviews. Participate in editorial meetings and brainstorming sessions.\n• Participate in various aspects of show production, including preparing scripts, graphics, and video elements. Help with logistics for on-location shoots, interviews, and live broadcasts.\n• Contribute to the show's social media presence by creating engaging content, live-tweeting during broadcasts, and participating in audience engagement efforts.\n• Attend workshops, training sessions, and mentoring opportunities designed to enhance your journalistic skills and industry knowledge.\n• Work with producers from story inception to finished package.\n• Will have opportunities to be part of the *LIVE* control room team and handle any duties that may come from breaking news.\n\nQualifications & Experience\n• Strong passion for journalism and current events with a keen interest in news production and reporting, and excellent written and verbal communication skills.\n• Detail-oriented, with the ability to work effectively in a fast-paced, high-pressure, collaborative environment.\n• Proficiency in conducting online research and using news-related software/tools.\n• Availability to work flexible hours in-person to accommodate the show's production schedule.\n• Must be actively enrolled in a U.S. accredited college or university degree program for the full duration of the internship (proof of enrollment required)\n• Must be a rising Junior or Senior (18 years or older)\n• Must be in academic good standing (3.0 or above GPA)\n• Warner Bros. Discovery will only consider candidates who are presently authorized to work for any employer in the United States and who will not require work visa sponsorship from Warner Bros. Discovery now or in the future in order to retain their authorization to work in the United States. Candidates currently on any student or exchange visa, including F-1 CPT, F-1 OPT, J-1, M-1, etc., will not be eligible for the internship program.\n\nNice To Haves\n• Experience using Adobe Premiere, iNews, or graphic design software is a plus.\n• Prior experience working in a newsroom or broadcast production.\n\nWhat to know before applying:\n• The duration of the summer program is 10 weeks.\n• Program dates:\n• Start Date: October 7th\n• End Date: December 13th\n• Interns will be expected to work 16-24 hours per week in an in-person capacity.\n• Our internships are paid opportunities with a competitive hourly wage. Credit is not required; however, we will provide the necessary documentation for school credit if desired. Relocation is not provided.\n• Interviewing will take place from February through mid-April. A WBD team member will contact you if your experiences and interests match an open internship position. Due to the high volume of applications, we are unable to give individual status updates.\n\nAbout Our Internship Program\n\nWBD's Internship Program is designed to nurture students professionally and personally. We attract the country’s boldest and brightest students for paid, for-credit, real-world internship experiences in the entertainment, tech, sports, news and media industries. We offer career-defining opportunities to learn valuable skills that will help you prepare for a successful future.\n\nReady to learn more? Here’s what we offer:\n• Hands-on work with passionate, talented team members in your field\n• Mentorship from some of the industry’s kindest and most passionate entertainment veterans\n• Engaging events including professional development seminars, panels with recruiters and former interns, intern-exclusive events, and so much more\n• Access to top-level executives and employees through our Speaker Series and Roundtables\n• Incredible networking opportunities with industry-leading professionals and a robust intern alumni network\n• A creative, collaborative, and inclusive company culture\n\nWhat you can expect to take away from the semester:\n• Opportunities to develop professionally and uncover skills you didn’t know you had\n• The insider scoop on the entertainment industry and what happens behind the scenes\n• Relationships that will go beyond your collegiate career\n• Real-life experiences that will provide you with the confidence to delve into your next adventure\n\nIn compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary and may be above or below the range based on various factors including but not limited to location, experience, and performance. The rate listed is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Rate: $19 per hour USD for undergrad interns.\n\nHow We Get Things Done…\n\nThis last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\n\nChampioning Inclusion at WBD\nWarner Bros. Discovery embraces the opportunity to build a workforce that reflects a wide array of perspectives, backgrounds and experiences. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.\n\nIf you’re a qualified candidate with a disability and you require adjustments or accommodations during the job application and/or recruitment process, please visit our accessibility page for instructions to submit your request.",
    "location": "New York, NY",
    "employment_type": "Part-time",
    "posted_at": "16 days ago",
    "apply_link": "https://careers.wbd.com/global/en/job/R000096202/CNN-News-Show-Team-Internships-NYC-Fall-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "Project Coordinator Intern",
    "company": "VX Media",
    "description": "VX Media - Project Coordinator Intern\n\nLocation: New York, NY\n\nType: Paid Internship - $20/hour, 5 days per week\n\nInternship Overview\n\nAs our Project Coordinator Intern, you’ll get hands‑on experience turning creative briefs into influencer campaigns across Instagram, TikTok, YouTube, and emerging platforms. Working side‑by‑side with our Project Manager and cross‑functional partners in Communications and Media Production, you’ll learn how to scope, launch, and close multi‑platform initiatives while maintaining brand, budget, and compliance standards.\n\nResponsibilities\n• Translate campaign objectives into integrated timelines, budgets, and resource plans and keep them current as scopes evolve.\n• Identify, vet, negotiate, and contract creators; secure usage rights, exclusivity terms, and clear deliverable calendars.\n• Drive day-to-day execution—kick-offs, content reviews, feedback loops, final approvals—ensuring every asset aligns with brand guidelines.\n• Track execution health: log blockers, revision cycles, scope changes, and schedule slippage in real time; escalate risks early and lead rapid resolutions to keep the project on track.\n• Maintain clear, proactive communication among internal teams, clients, and creators through structured status updates and review workflows.\n• After launch, produce a concise post-campaign report that details execution KPIs (on-time delivery rate, budget adherence, issue log, lessons learned) and summarizes high-level content performance with actionable next-step recommendations.\n\nQualifications\n• Education: Currently pursuing—or recently completed—a bachelor’s or master’s degree in any discipline that builds problem-solving and teamwork skills (e.g., business, engineering, communications, computer science).\n• Project experience: Hands-on involvement in any setting—class projects, student-club leadership, capstone courses, part-time work—where you planned, organized, and delivered real outcomes.\n• Tool curiosity: Comfortable with spreadsheets and eager to learn industry-standard project-management platforms.\n• Analytical mindset: Able to break goals into measurable tasks, track timelines/metrics, and summarize insights for non-technical audiences.\n• Communication & stakeholder skills: Clear writer and confident speaker; can tailor updates for teammates, senior leaders, or external partners.\n• Organization & follow-through: Proven ability to juggle multiple priorities, keep accurate records, and hit deadlines with minimal supervision.\n• Growth attitude: Passion for continuous improvement, willingness to ask questions, and drive to build a career in project and program management.\n• Work eligibility: Legally authorized to work in the United States for the duration of the internship.\n• Flexibility: Openness to occasional evening/weekend syncs or light travel to support project milestones.\n• Professionalism & discretion: Understands the importance of confidentiality, data security, and brand standards.",
    "location": "New York, NY",
    "employment_type": "Internship",
    "posted_at": "7 hours ago",
    "apply_link": "https://www.linkedin.com/jobs/view/project-coordinator-intern-at-vx-media-4280314049?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "Strategy and Business Development Intern (New York) – Summer 2026",
    "company": "The D. E. Shaw Group",
    "description": "The D. E. Shaw group seeks motivated, intellectually curious students to join one of our strategy and business development (SBD) groups as interns in our New York office. Throughout the internship, you’ll have the opportunity to collaborate with a collegial team on challenging, impactful projects that are core to the firm’s internal and external development. This is a ten-week program that will take place in New York and is expected to run from June to August 2026.",
    "location": "New York, NY",
    "employment_type": "Internship",
    "posted_at": "10 hours ago",
    "apply_link": "https://www.deshaw.com/careers/strategy-and-business-development-intern-new-york-summer-2026-5377?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  },
  {
    "title": "Publicity Intern",
    "company": "APEX Public Relations",
    "description": "APEX PR is looking for a part-time intern in New York with an interest in gaining experience in publicity and entertainment/special events. We are looking for someone who is reliable and professional, proficient in Word/Excel/Google Drive, a solid communicator, detail-oriented, and has a strong interest in a career in public relations. College credit is required. The position is hybrid with both remote and in-office work, as well as in-person event opportunities in NYC.\n\nOur team's clients include Condé Nast, Netflix, The Tony Awards, GLAAD, New York Magazine, The Breast Cancer Research Foundation, The Museum of Broadway, and many more across entertainment, non-profit, and event spaces. To learn more about the company, please visit our Instagram - @apexpublicrelations.\n\nResponsibilities include:\n• Maintaining media lists and databases\n• Servicing publicity clips\n• Administrative support\n• Research\n• Attending in-person and virtual client events\n• Other duties as assigned\n\nRequirements:\n• Must be a student and receive class credit for the internship\n• Able to commit to 16-24 hours a week//occasional weeknight/weekend work as needed for on-site event needs.\n\nTo apply for this position, please submit your resume and cover letter.\n\nJob Type: Internship\n\nPay: $1.00 - $25.73 per hour\n\nExpected hours: 16 – 24 per week\n\nWork Location: Hybrid remote in New York, NY 10001",
    "location": "New York, NY",
    "employment_type": "Internship",
    "posted_at": "1 day ago",
    "apply_link": "https://www.indeed.com/viewjob?jk=d2e34b83f1e701d6&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "is_remote": false
  }
]